app/views/sellers/dashboard.html.erb

        <% if order.dispatched_time == nil && order.delivered_time == nil %>
          <% item = Item.find(order.item_id) %>
---
SELECT `items`.* FROM `items` WHERE `items`.`seller_id` = 'Harsha'

                <td><%= order.ordered_time.to_formatted_s(:long_ordinal)  %></td>
                <td><i class="fa fa-check-square fa-lg" aria-hidden="true"><%= link_to 'Dispatch', { controller: "sellers", action: "dispatched", id: order.order_id} %> </i></td>
---
SELECT  `sellers`.* FROM `sellers` WHERE `sellers`.`seller_id` = 'Harsha' LIMIT 1