app/views/sellers/my_items.html.erb

            <% item.each do |item| %>
              <% sub_category = SubCategory.find(item.sub_category_id) %>
---
SELECT  `sub_categories`.* FROM `sub_categories` WHERE `sub_categories`.`sub_category_id` = 2 LIMIT 1