app/views/orders/index.html.erb

SELECT  `items`.* FROM `items` WHERE `items`.`item_id` = 1 LIMIT 1
SELECT `orders`.* FROM `orders` WHERE (user_id == '1')
---
    <% @orders.each do |order| %>
        <% $item = Item.find(order.item_id) %>
      <tr>
        <td><%= order.order_id %></td>

SELECT `orders`.* FROM `orders` WHERE (user_id = 'usman2897') ORDER BY `orders`.`ordered_time` DESC
---
        <td><%= order.total_price %></td>
        <td><%= order.ordered_time.to_formatted_s(:long_ordinal)  %></td>