app/views/orders/myorders.html.erb

<% @orders.each do |order| %>
    <% item = Item.find(order.item_id) %>
---
SELECT  `items`.* FROM `items` WHERE `items`.`item_id` = 6 LIMIT 1