app/views/orders/show.html.erb

SELECT  `orders`.* FROM `orders` WHERE `orders`.`order_id` = 1 LIMIT 1
---
  <strong>Order:</strong>
  <%= @order.order_id %>