app/views/items/_form.html.erb

SELECT `sub_categories`.* FROM `sub_categories` WHERE `sub_categories`.`category_id` = 1
---
    <%= f.label :category_id %>
    <%= f.collection_select :category_id, Category.all, :category_id, :category_name %>

SELECT  `sub_categories`.* FROM `sub_categories` WHERE `sub_categories`.`sub_category_id` = 1 LIMIT 1
---
    <%= f.label :sub_category_id %>
    <%= f.collection_select :sub_category_id, SubCategory.all, :sub_category_id, :sub_category_name %>