app/views/items/cat.html.erb

SELECT `items`.* FROM `items` WHERE (sub_category_id = 1) ORDER BY `items`.`hits` DESC
---
    <% @sub_categories.each do |sub_category| %>
        <% items = Item.where('sub_category_id = ?', sub_category.sub_category_id).order(hits: :desc) %>

SELECT  `sub_categories`.* FROM `sub_categories` WHERE `sub_categories`.`sub_category_id` = 1 LIMIT 1
---
                <% item.each do |item| %>
                <% sub_category = SubCategory.find(item.sub_category_id) %>