app/views/items/index.html.erb

    <h2><%= link_to category.category_name, { controller: "items", action: "cat", category: category.category_id } %></h2>
    <% items = Item.where('category_id = ?', category.category_id).order(hits: :desc).limit(3) %>
---
SELECT  `items`.* FROM `items` WHERE (category_id = 1) AND (quantity > 0) ORDER BY `items`.`hits` ASC LIMIT 3

            <% item.each do |item| %>
              <% sub_category = SubCategory.find(item.sub_category_id) %>
---
SELECT  `sub_categories`.* FROM `sub_categories` WHERE `sub_categories`.`sub_category_id` = 1 LIMIT 1