app/controllers/feedbacks_controller.rb

SELECT `feedbacks`.* FROM `feedbacks`
---
  def index
    @feedbacks = Feedback.all

INSERT INTO `feedbacks` (`user_id`, `time_date`, `feedback`) VALUES ('usman2897', '2017-05-28 13:11:27', 'Awesome work done by you guys but i feel that it could have been better in terms of beautifying')
---
  def create
    @feedback = Feedback.new(feedback_params)
    current_account_user
    if account_user_signed_in? != true
      redirect_to users_login_url, notice: "User have to be signed in to give feedback!"
    end
    @feedback.user_id = @current_user.user_id
    @feedback.time_date = Time.now + to_ist
    respond_to do |format|
      if @feedback.save