app/controllers/items_controller.rb

SELECT `sub_categories`.* FROM `sub_categories` WHERE `sub_categories`.`category_id` = 1
SELECT `items`.* FROM `items` WHERE (quantity > 0)
---
  def index
    current_account_seller
    @categories = Category.all
    @item = Item.all

SELECT  `items`.* FROM `items` WHERE `items`.`item_id` = 1 LIMIT 1
UPDATE `items` SET `hits` = 1 WHERE `items`.`item_id` = 40
SELECT `sub_categories`.* FROM `sub_categories` WHERE `sub_categories`.`category_id` = 1
SELECT  `sub_categories`.* FROM `sub_categories` WHERE `sub_categories`.`sub_category_id` = 1 LIMIT 1
---
  def show
    current_account_seller
    @item = Item.find(params[:id]).nil? ? Item.find(params[:search]) : Item.find(params[:id])
    @item.update_attribute(:hits, @item.hits + 1)
    @category = Category.find(@item.category_id)
    @sub_category = SubCategory.find(@item.sub_category_id)

SELECT `sub_categories`.* FROM `sub_categories` WHERE `sub_categories`.`category_id` = 1
---
  def new
    if account_seller_signed_in? != true
      redirect_to sellers_login_url
    end
    @item = Item.new
    @categories = Category.all

SELECT  `items`.* FROM `items` WHERE `items`.`item_name` = 'Wired Mouse' AND `items`.`category_id` = 1 AND `items`.`sub_category_id` = 7 AND `items`.`price` = 500.0 AND `items`.`seller_id` = 'usmn' AND `items`.`brand` = 'Dell' ORDER BY `items`.`item_id` ASC LIMIT 1
UPDATE `items` SET `quantity` = 14 WHERE `items`.`item_id` = 12
INSERT INTO `items` (`item_name`, `category_id`, `sub_category_id`, `quantity`, `price`, `description`, `seller_id`, `image`) VALUES ('Lenova', 1, 1, 14, 1000.0, 'Good Srackers', 'Harsha', 'apple-logo-outline-computer-hd-wallpaper-1920x1080-4224.jpg')
---
  def create
    if account_user_signed_in?
      redirect_to items_url
    end
    current_account_seller
    @item = Item.new(item_params)
    @item.seller_id = @current_seller.seller_id
    @similar = Item.where(item_name: @item.item_name, category_id: @item.category_id, sub_category_id: @item.sub_category_id, price: @item.price, seller_id: @item.seller_id, brand: @item.brand ).first
    if @similar != nil
      @similar.update_attribute(:quantity, @item.quantity + @similar.quantity)
      redirect_to @item, notice: 'Item was successfully updated.'
    else
      respond_to do |format|
        if @item.save

UPDATE `items` SET `item_name` = 'Mouse', `brand` = 'Dell', `quantity` = 1 WHERE `items`.`item_id` = 11
---
  def update
    respond_to do |format|
      if @item.update(item_params)

SELECT  `categories`.* FROM `categories` WHERE `categories`.`category_id` = 1 LIMIT 1
SELECT  `sub_categories`.* FROM `sub_categories` WHERE `sub_categories`.`sub_category_id` = 1 LIMIT 1
---
  def cat
    @category = Category.find(params[:category])
    @sub_categories = SubCategory.where('category_id = ?', @category.category_id)

SELECT  `items`.* FROM `items` WHERE `items`.`item_id` = 1 LIMIT 1
---
    def set_item
      @item = Item.find(params[:id])