app/controllers/items_controller.rb

DELETE FROM `items` WHERE `items`.`item_id` = 1
---
  def show
    current_account_seller
    @item = Item.find(params[:id])
    if(@item.quantity == 0)
      @item.destroy