app/controllers/orders_controller.rb

  def index
    current_account_user
    @orders = Order.where( "user_id = ?", @current_user.user_id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`user_id` IS NULL LIMIT 1