app/controllers/orders_controller.rb

SELECT `orders`.* FROM `orders` WHERE (user_id = 'usman2897') ORDER BY `orders`.`delivered_time` DESC
---
  def index
    current_account_user
    if account_user_signed_in?
      @orders = Order.where( "user_id = ?", @current_user.user_id).order(:delivered_time)

SELECT  `orders`.* FROM `orders` WHERE `orders`.`order_id` = 1 LIMIT 1
---
  def show
    current_account_user
    @order = Order.find_by(order_id: params[:id])

SELECT  `items`.* FROM `items` WHERE `items`.`item_id` = 6 LIMIT 1
---
  def new
    current_account_user
    if account_user_signed_in? != true
      redirect_to users_login_url, notice: 'User must be loggedin!'
    else
      @order = Order.new
      $item = Item.find(params[:item])

SELECT  `orders`.* FROM `orders` WHERE `orders`.`order_id` = 31 AND `orders`.`item_id` = 12 ORDER BY `orders`.`order_id` ASC, `orders`.`item_id` ASC LIMIT 1
SELECT  `items`.* FROM `items` WHERE `items`.`item_id` = 2 LIMIT 1
SELECT  `orders`.* FROM `orders` WHERE (19) LIMIT 1
---
  def edit
    @order = Order.where( order_id: params[:id].split(',').first, item_id: params[:id].split(',').last ).first
    $item = Item.find(@order.item_id)

SELECT  `items`.* FROM `items` WHERE `items`.`item_id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`user_id` = 'usman2897' LIMIT 1
SELECT `orders`.* FROM `orders` WHERE (order_id = NULL)
INSERT INTO `orders` (`user_id`, `item_id`, `ordered_quantity`, `total_price`, `ordered_time`) VALUES ('1', 39, 2, 20000.0, '2017-05-22 10:00:23')
---
  def create
    @order = Order.new(order_params)
    current_account_user
    @order = Order.new
    @order.item_id = $item.item_id
    @order.user_id = @current_user.user_id
    @order.ordered_quantity = order_params[:ordered_quantity]
    @order.total_price = $item.price * @order.ordered_quantity
    @order.ordered_time = Time.now + to_ist
    respond_to do |format|
      if @order.save

SELECT  `orders`.* FROM `orders` WHERE (`orders`.`order_id` = 31 AND `orders`.`item_id` = 12) LIMIT 1
UPDATE `items` SET `quantity` = 15 WHERE `items`.`item_id` = 12
UPDATE `orders` SET `ordered_quantity` = 2, `total_price` = 400.0, `ordered_time` = '2017-05-28 14:57:06', `address` = '' WHERE (`orders`.`order_id` = 66 AND `orders`.`item_id` = 43)
---
  def update
    @order = Order.find(params[:id])
    current_account_user
    #@order.order_id = params[:id].split(',').first
    #@order.user_id = @current_user.user_id
    #@order.item_id = params[:id].split(',').last
    $item.update_attribute(:quantity, $item.quantity+@order.ordered_quantity)

SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 'usman2897'
---
  def myorders
    current_account_user
    @orders = Order.where(:user_id => @current_user)

SELECT `orders`.* FROM `orders` WHERE (user_id == '1')
---
    def set_order

      @orders = Order.where(:user_id => @current_user)