app/controllers/sellers_controller.rb

SELECT  `sellers`.* FROM `sellers` WHERE `sellers`.`seller_id` = 'someone' LIMIT 1
---
  def index
    @sellers = Seller.all

INSERT INTO `sellers` (`seller_id`, `organization`, `password_digest`) VALUES ('someone', 'some', '$2a$10$SfpVvOMW9rFLiTQu1rpXV.qJ2Jv69zYLuy1ym4YFtUHgeyjP70MD.')
---
  def create
    @seller = Seller.new(seller_params)

    respond_to do |format|
      if @seller.save

SELECT  `sellers`.* FROM `sellers` WHERE `sellers`.`seller_id` = 'someone' LIMIT 1
---
  def loggedin
    @seller = Seller.find_by("LOWER(seller_id) = ?",login_params[:seller_id].downcase)

SELECT `categories`.* FROM `categories`
SELECT  `sellers`.* FROM `sellers` WHERE `sellers`.`seller_id` = 'someone' LIMIT 1
---
  def my_items
    @categories = Category.all
    current_account_seller
    if account_seller_signed_in?
      @items = Item.where('seller_id = ?', @current_seller.seller_id)

SELECT  `sellers`.* FROM `sellers` WHERE `sellers`.`seller_id` = 'Harsha' LIMIT 1
SELECT `items`.* FROM `items` WHERE `items`.`seller_id` = 'Harsha'
SELECT `items`.* FROM `items` WHERE `items`.`item_id` = 1
SELECT `orders`.* FROM `orders` WHERE `orders`.`item_id` = 1
---
  def dashboard
    @orders = Array.new
    current_account_seller
    if account_seller_signed_in?
      @items = Item.where(seller_id: @current_seller.seller_id)
      @items.each do |item|
        @temp = Order.where(item_id: item.item_id)

SELECT  `orders`.* FROM `orders` WHERE `orders`.`order_id` IS NULL LIMIT 1
UPDATE `orders` SET `dispatched_time` = '2017-05-23 09:54:42' WHERE (`orders`.`order_id` = 21 AND `orders`.`item_id` = 6)
---
  def dispatched
    @order = Order.find_by(order_id: params[:id])
    #@order.dispatched_time = Time.now + 5.hours + 30.minutes
    #@order.save
    @order.update_attribute(:dispatched_time, (Time.now + 5.hours + 30.minutes))

SELECT  `orders`.* FROM `orders` WHERE `orders`.`order_id` = 21 LIMIT 1
UPDATE `orders` SET `delivered_time` = '2017-05-23 15:28:46' WHERE (`orders`.`order_id` = 21 AND `orders`.`item_id` = 6)
---
  def deliver
    @order = Order.find_by(order_id: params[:id])
    #@order.dispatched_time = Time.now + 5.hours + 30.minutes
    #@order.save
    @order.update_attribute(:delivered_time, (Time.now + 5.hours + 30.minutes))

UPDATE `sellers` SET `password_digest` = '$2a$10$xTrF9bKRpUCKh/DjAhgDYeFLzjjEOGcMSbqzqLnNB0MK36BDjWcMq' WHERE `sellers`.`seller_id` = 'Harsha'
---
  def update
    respond_to do |format|
      if @seller.update(seller_params)

DELETE FROM `sellers` WHERE `sellers`.`seller_id` = 'Harsha'
---
  def destroy
    @seller.destroy

SELECT  `sellers`.* FROM `sellers` WHERE `sellers`.`seller_id` = 'someone' LIMIT 1
---
    def set_seller
      @seller = Seller.find(params[:id])