app/controllers/sub_categories_controller.rb

  def index
    @sub_categories = SubCategory.all
---
SELECT `sub_categories`.* FROM `sub_categories`