app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT  `users`.* FROM `users` WHERE `users`.`user_id` = 'usman2897' LIMIT 1

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`user_id`, `user_name`, `user_email`, `password_digest`, `user_phone`) VALUES ('usman2897', 'Mohammed Usman', 'musman2897@gmail.com', '$2a$10$9HFg2LxY8y7jTRdsbwsmHugzAKBUU1PvZNy0Rh63nt3V/Kw3r6UTW', 8553853415)

  def loggedin
    @user = User.find_by("LOWER(user_id) = ?",login_params[:user_id].downcase)
---
SELECT  `users`.* FROM `users` WHERE (LOWER(user_id) = 'harsha') LIMIT 1

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `password_digest` = '$2a$10$kZxfsX68sWCfqXkUD4iNi.wLt5J5OZHt5SignlChAHpPqED6XYUsK', `user_phone` = 7899324507 WHERE `users`.`user_id` = '72'

  def destroy
    current_account_user
    if account_user_signed_in? != true || (@current_user.user_id != @user.user_id)
      redirect_to items_url
    end
    @user.destroy
---
DELETE FROM `users` WHERE `users`.`user_id` = '1'

    def set_user
      @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`user_id` = 'usman2897' LIMIT 1